ab.nginx.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        nginx/1.10.0
Server Hostname:        127.0.0.1
Server Port:            80

Document Path:          /
Document Length:        7667 bytes

Concurrency Level:      10
Time taken for tests:   5.898 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      7864000 bytes
HTML transferred:       7667000 bytes
Requests per second:    169.54 [#/sec] (mean)
Time per request:       58.982 [ms] (mean)
Time per request:       5.898 [ms] (mean, across all concurrent requests)
Transfer rate:          1302.05 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     8   59   4.4     58      78
Waiting:        8   59   4.4     58      78
Total:          8   59   4.4     58      78

Percentage of the requests served within a certain time (ms)
  50%     58
  66%     59
  75%     59
  80%     60
  90%     61
  95%     64
  98%     76
  99%     77
 100%     78 (longest request)